help_txt = "Перечень команд, которые я могу выполнить:\n " \
           "/week - отображает какая на данный момент неделя (четная/нечетная)\n" \
           "/mtuci - дает ссылку на официальный сайт МТУСИ\n " \
           "/mon - расписание на понедельник\n" \
           "/tue - расписание на вторник\n" \
           "/wed - расписание на среду\n" \
           "/thu - расписание на четверг\n" \
           "/fri - расписание на пятницу\n" \
           "/sat - расписание на субботу\n" \
           "/curwk - расписание на текущую неделю\n" \
           "/nxtwk - расписание на следующую неделю"
